app/views/auction_app/index.html.erb

SELECT "answers".* FROM "answers"
SELECT COUNT(*) AS "count_all", "answers"."q1answer" AS "answers_q1answer" FROM "answers" GROUP BY "answers"."q1answer"
SELECT COUNT(*) AS "count_all", "answers"."q2answer" AS "answers_q2answer" FROM "answers" GROUP BY "answers"."q2answer"
SELECT COUNT(*) AS "count_all", "answers"."q3answer" AS "answers_q3answer" FROM "answers" GROUP BY "answers"."q3answer"
---
</table>
    <%= pie_chart Answer.group(:q1answer).count, title: "Question 1" %>
    <%= pie_chart Answer.group(:q2answer).count, title: "Question 2" %>
    <%= pie_chart Answer.group(:q3answer).count, title: "Question 3" %>