app/controllers/auction_app_controller.rb

SELECT "answers".* FROM "answers"
SELECT COUNT(*) FROM "answers"
---
  def index
    puts "-----------In Index------------"
    @allAnswers = Answer.all

    puts "# of answers = #{@allAnswers.size}"

INSERT INTO "answers" ("name", "q1answer", "q2answer", "q3answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "jeff"], ["q1answer", 2.0], ["q2answer", 3.0], ["q3answer", 6.0], ["created_at", "2022-05-17 01:26:37.166081"], ["updated_at", "2022-05-17 01:26:37.166081"]]
---
  def enterBid
    puts "-----------In Enter Bid------------"

    #amount = params[:amountInput].to_f

    name = params[:n]
    q1answer = params[:q1].to_f
    q2answer = params[:q2].to_f
    q3answer = params[:q3].to_f

    #map = {"bidder" => bidder, "amount" => amount}
    map = {"name" => name, "q1answer" => q1answer, "q2answer" => q2answer, "q3answer" => q3answer}
    #newRow = Bid.new(map)
    newRow = Answer.new(map)
    respond_to do |format|
      if newRow.save